blog/2021/03/12/emacs-font/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Emacs: font - 你对这个世界要有点意见</title>
  <meta charset="utf-8" />
  <meta name="author" content="lijigang" />


  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
</head>

  <body class="container">
<header id="header">
<body>
    <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
        <div class="container-fluid">
<div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">你对这个世界要有点意见</a>
        </div>
<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                <li class="active"><a href="/">Blog</a></li>
          <li><a href="https://github.com/lijigang">GitHub</a></li>
          <li><a href="http://www.zhihu.com/people/lijigang.com">知乎</a></li>
        </ul>
</div>
</div>
    </nav>
</body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row post-content">
        <div class="col-md-2"></div>
            <h1>Emacs: font</h1>
            <p>
Emacs中字体配置只需要两步即可搞定。
</p>

<div id="outline-container-org25e0de5" class="outline-2">
<h2 id="org25e0de5">第一步: 配置(英文) <code>默认字体</code></h2>
<div class="outline-text-2" id="text-org25e0de5">
<blockquote>
<p>
Signature
(set-face-attribute FACE FRAME &amp;rest ARGS)
</p>

<p>
Documentation
Set attributes of FACE on FRAME from ARGS.
</p>

<p>
ARGS must come in pairs ATTRIBUTE VALUE.
</p>

<p>
Demos
</p>

<div class="org-src-container">
<pre class="src src-elisp">(set-face-attribute 'default nil :font "Source Code Pro-13")
</pre>
</div>
</blockquote>

<p>
只需要使用 <code>set-face-attribute</code> 函数，指定其中的 <code>:font</code> attribute 即可设定默认的字
符(英文)的字体.
</p>
</div>
</div>

<div id="outline-container-orgb2c9d45" class="outline-2">
<h2 id="orgb2c9d45">第二步: 配置(中文) <code>补余字体</code></h2>
<div class="outline-text-2" id="text-orgb2c9d45">
<p>
第一步设置的默认字体, 如果(大概率)未包含你想要显示的字符--比如中文,日文,或者
Emoji--就会有一个Fallback 搜索字体的机制运行，这个结果不太可靠, 所以需要我们做第
二步设置, 指定中文(或其它)的对应字体。
</p>

<blockquote>
<p>
(set-fontset-font NAME TARGET FONT-SPEC &amp;optional FRAME ADD)
</p>

<p>
Documentation
Modify fontset NAME to use FONT-SPEC for TARGET characters.
</p>
</blockquote>

<p>
只需要使用 <code>set-fontset-font</code> 函数, 注意其中的 <b>TARGET</b> 参数, 该参数决定了你的补余范
围--比如中文字符集, 就可以指定 TARGET 相关的字符所对应的字体了。
</p>
</div>
</div>

<div id="outline-container-orgcd8744d" class="outline-2">
<h2 id="orgcd8744d">一些其它小事</h2>
<div class="outline-text-2" id="text-orgcd8744d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Emacs 术语</th>
<th scope="col" class="org-left">日常用语</th>
<th scope="col" class="org-left">使用场景</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">variable pitch font</td>
<td class="org-left">proportional font</td>
<td class="org-left">usual text</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fixed pitch font</td>
<td class="org-left">monospace font</td>
<td class="org-left">source code</td>
</tr>
</tbody>
</table>
</div>
</div>

    </div>
</section>




<footer id="footer">
    <br />
    <script>
        var _hmt = _hmt || [];
        (function() {
            var hm = document.createElement("script");
            hm.src = "https://hm.baidu.com/hm.js?36d44a2295ffa55a3ab51c6aa7a71733";
            var s = document.getElementsByTagName("script")[0];
            s.parentNode.insertBefore(hm, s);
        })();
    </script>
</footer>

  </body>
</html>
